In [25]:
import pandas as pd

## 基本数据结构

In [4]:
s=pd.Series([4,2,5,0,6,3])
print(s)

0    4
1    2
2    5
3    0
4    6
5    3
dtype: int64

In [8]:
df=pd.DataFrame(np.random.randn(6,4),columns=list('ABCD'))#字符串序列
print(df)

          A         B         C         D
0 -0.953956  0.191912  0.123135 -0.885457
1  0.051655 -1.772148  0.174171 -0.037571
2  1.203814 -1.627173  1.698250  0.864218
3 -0.041534  0.854669  1.202244  0.125089
4  0.167210 -0.645308 -0.505479  0.930067
5  0.032698 -0.051839  0.039155  1.857809

In [9]:
df=pd.DataFrame(np.random.randn(6,4),columns=list(['name','age','sex','height']))#列表变量
print(df)

       name       age       sex    height
0  1.143611 -0.018307  0.120381 -0.489069
1 -0.823927  0.042087 -0.232194  0.271869
2  0.847216 -0.014321  0.417708  2.315123
3  0.760645  1.274280 -0.817305  0.362677
4  0.203293 -0.709781 -0.316190 -0.123101
5 -0.345134 -1.087723 -1.221039  0.629646

In [10]:
df.iloc[1]#按序号列

name     -0.823927
age       0.042087
sex      -0.232194
height    0.271869
Name: 1, dtype: float64

In [12]:
df.name#按列名

0    1.143611
1   -0.823927
2    0.847216
3    0.760645
4    0.203293
5   -0.345134
Name: name, dtype: float64

In [13]:
df.shape#属性

(6, 4)

In [14]:
df.head(3)#头几行

       name       age       sex    height
0  1.143611 -0.018307  0.120381 -0.489069
1 -0.823927  0.042087 -0.232194  0.271869
2  0.847216 -0.014321  0.417708  2.315123

In [16]:
df.tail(3)#后几行

       name       age       sex    height
3  0.760645  1.274280 -0.817305  0.362677
4  0.203293 -0.709781 -0.316190 -0.123101
5 -0.345134 -1.087723 -1.221039  0.629646

In [18]:
df.index#行索引

RangeIndex(start=0, stop=6, step=1)

In [19]:
df.columns#列索引

Index(['name', 'age', 'sex', 'height'], dtype='object')

In [21]:
df.describe()#数据统计信息

           name       age       sex    height
count  6.000000  6.000000  6.000000  6.000000
mean   0.297618 -0.085628 -0.341440  0.494524
std    0.763157  0.808584  0.600383  0.974548
min   -0.823927 -1.087723 -1.221039 -0.489069
25%   -0.208027 -0.536912 -0.692026 -0.024359
50%    0.481969 -0.016314 -0.274192  0.317273
75%    0.825573  0.027985  0.032237  0.562904
max    1.143611  1.274280  0.417708  2.315123

## 数据映射

In [22]:
a=pd.Series(['C','Java','C++'])
print(a)

0       C
1    Java
2     C++
dtype: object

In [24]:
b=a.map({'C':22,'Java':11,'C++':33})#字典
print(b)

0    22
1    11
2    33
dtype: int64

## 排序

In [26]:
df=pd.DataFrame(np.random.randn(6,4),columns=list(['name','age','sex','height']))#列表变量
print(df)

       name       age       sex    height
0  0.046845 -0.851778  0.378981  0.638172
1  2.069104  0.773468 -0.532146 -0.310100
2 -0.599982  0.377808 -0.259405 -0.716628
3 -0.129534 -0.558052 -0.490291  0.864679
4 -0.047746  1.242900  1.564950 -1.208797
5 -0.302691  1.169751  0.773119  0.590633

In [27]:
df.sort_index(axis=1,ascending=False)#axis=1/0按列/行 ascending升序降序

        sex      name    height       age
0  0.378981  0.046845  0.638172 -0.851778
1 -0.532146  2.069104 -0.310100  0.773468
2 -0.259405 -0.599982 -0.716628  0.377808
3 -0.490291 -0.129534  0.864679 -0.558052
4  1.564950 -0.047746 -1.208797  1.242900
5  0.773119 -0.302691  0.590633  1.169751

In [29]:
df.sort_values(by='name')#按照值排序

       name       age       sex    height
2 -0.599982  0.377808 -0.259405 -0.716628
5 -0.302691  1.169751  0.773119  0.590633
3 -0.129534 -0.558052 -0.490291  0.864679
4 -0.047746  1.242900  1.564950 -1.208797
0  0.046845 -0.851778  0.378981  0.638172
1  2.069104  0.773468 -0.532146 -0.310100

## 数据访问

In [30]:
df=pd.DataFrame(np.random.randn(6,4),columns=list(['name','age','sex','height']))#列表变量
print(df)

       name       age       sex    height
0  1.429334 -0.705854 -0.303204 -0.049728
1 -1.901973 -1.575080  2.012745  1.213043
2  1.880551 -3.697008  0.799548  0.032265
3  0.177487  0.715374  0.246039  1.063959
4 -0.893445 -0.484181  0.337124 -0.639476
5 -0.272419 -1.001143  1.199657  0.456524

In [32]:
df.values#原始数据

array([[ 1.42933397, -0.7058537 , -0.30320415, -0.04972812],
       [-1.90197304, -1.57507988,  2.01274549,  1.2130425 ],
       [ 1.88055133, -3.69700782,  0.79954835,  0.03226539],
       [ 0.1774872 ,  0.71537439,  0.24603904,  1.06395865],
       [-0.89344463, -0.48418119,  0.33712405, -0.63947611],
       [-0.27241889, -1.0011426 ,  1.19965714,  0.4565242 ]])

In [35]:
df[3:5]#按照行索引范围

       name       age       sex    height
3  0.177487  0.715374  0.246039  1.063959
4 -0.893445 -0.484181  0.337124 -0.639476

In [37]:
df[['name','sex','height']]

       name       sex    height
0  1.429334 -0.303204 -0.049728
1 -1.901973  2.012745  1.213043
2  1.880551  0.799548  0.032265
3  0.177487  0.246039  1.063959
4 -0.893445  0.337124 -0.639476
5 -0.272419  1.199657  0.456524

In [40]:
df.loc[3,'name'] #第X行第几列

0.17748720236669144

In [41]:
df.iloc[3,0]#通过数组索引范围

0.17748720236669144

In [42]:
df.iloc[2:5,0:2]

       name       age
2  1.880551 -3.697008
3  0.177487  0.715374
4 -0.893445 -0.484181

In [44]:
df[df.name>0]#某行大于0

       name       age       sex    height
0  1.429334 -0.705854 -0.303204 -0.049728
2  1.880551 -3.697008  0.799548  0.032265
3  0.177487  0.715374  0.246039  1.063959

In [47]:
df['TAG']=['cat','dog','cat','cat','cat','dog']#添加一列
df

       name       age       sex    height  TAG
0  1.429334 -0.705854 -0.303204 -0.049728  cat
1 -1.901973 -1.575080  2.012745  1.213043  dog
2  1.880551 -3.697008  0.799548  0.032265  cat
3  0.177487  0.715374  0.246039  1.063959  cat
4 -0.893445 -0.484181  0.337124 -0.639476  cat
5 -0.272419 -1.001143  1.199657  0.456524  dog

In [49]:
df.groupby('TAG').sum()#根据TAG列做分组统计

         name       age       sex    height
TAG
cat  2.593928 -4.171668  1.079507  0.407020
dog -2.174392 -2.576222  3.212403  1.669567

## 文件读写

In [50]:
df = pd.read_csv('data.csv', index_col=0)#读取文件从第0行开始

In [51]:
df.shape

(100, 4)

In [52]:
df.head(5)

          A         B         C         D
0  0.845734  1.359361  1.148205 -1.021024
1 -2.014522 -0.045063  1.329018 -0.176059
2 -0.411952 -0.652460 -2.277084 -0.648005
3  1.179014 -0.218886 -0.629854 -0.474365
4  1.523180 -0.904850  0.788943 -0.095711

In [53]:
df.to_csv('csv_data_save.csv')#保存csv

In [55]:
df.to_excel('excel_data_save.xls')#保存excel

<ipython-input-55-3ec1a8db06cf>:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel('excel_data_save.xls')#保存excel